rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]
---
  def findAllMoviesByDirector
    @movie = Movie.find(params[:id])
    director = @movie.director
    #debugger
    if(director.empty?)
      flash[:notice] = "'#{@movie.title}' has no director info"
      redirect_to(movies_path)
    else
      @movies = Movie.where(Director: director)